
x=8000;#每月工资
y=3000;#年终奖分摊每月额
#月工资与年终奖分开算，即年终奖不分摊到每月，年总为Z

if (x-5000) <= 3000:
    X = (x-5000)*0.03-0

elif  (x-5000) <= 12000:
    X = (x-5000)*0.1-210   
    
elif  (x-5000) <= 25000:
    X = (x-5000)*0.2-1410  #Z=12*X+Y  


if y <= 3000:
    Y = 12*y*0.03-0

elif  y <= 12000:
    Y = 12*y*0.1-210

elif  y <= 25000:
    Y = 12*y*0.2-1410   #Z=12*X+Y


#月工资与年终奖合并计算，即年终奖分摊到每月,年总为P

if (x+y-5000) <= 3000:
    P = 12*((x+y-5000)*0.03-0)
  
elif  y <= 12000:
    P = 12*((x+y-5000)*0.1-210)
  
elif  y <= 25000:
    P = 12*((x+y-5000)*0.2-1410)

print(12*X+Y)
print(P)